In [4]:
##Conditional Dataframe

In [ ]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [ ]:
rann= np.random.seed(101)

In [5]:
df = pd.DataFrame(randn(3,4), ['A', 'B', 'C'], ['W', 'X', 'Y', 'Z'])
df

          W         X         Y         Z
A -0.159073  3.013091 -0.315412 -1.596046
B -0.604125 -0.812272  0.526444 -1.036904
C  0.209760 -0.134528  1.853700 -0.149177

In [6]:
df>0

       W      X      Y      Z
A  False   True  False  False
B  False  False   True  False
C   True  False   True  False

In [7]:
booldf = df>0

booldf

       W      X      Y      Z
A  False   True  False  False
B  False  False   True  False
C   True  False   True  False

In [8]:
df[booldf]

         W         X         Y   Z
A      NaN  3.013091       NaN NaN
B      NaN       NaN  0.526444 NaN
C  0.20976       NaN  1.853700 NaN

In [9]:
df[df>0] #df greater than 0

         W         X         Y   Z
A      NaN  3.013091       NaN NaN
B      NaN       NaN  0.526444 NaN
C  0.20976       NaN  1.853700 NaN

In [10]:
df['W']>0

A    False
B    False
C     True
Name: W, dtype: bool

In [11]:
df[df['W']>0] # you will be getting only the satisfied conditions

         W         X       Y         Z
C  0.20976 -0.134528  1.8537 -0.149177

In [14]:
df[df['Z']>0] #values of Z is all -ve

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [17]:
# return a data fram that happened to be greater than 0 and then grab X column

df[df['W']>0]['X']

C   -0.134528
Name: X, dtype: float64

In [20]:
# Above example in two step

wseries = df[df['W']>0]
wseries['X']

C   -0.134528
Name: X, dtype: float64

In [29]:
df[df['W']>0][['Y', 'X']]

        Y         X
C  1.8537 -0.134528

In [25]:
#in case of multiple condition
#&--> and
#|--> or

df[(df['W']>0) & (df['X']<1)]

         W         X       Y         Z
C  0.20976 -0.134528  1.8537 -0.149177

In [30]:
df

          W         X         Y         Z
A -0.159073  3.013091 -0.315412 -1.596046
B -0.604125 -0.812272  0.526444 -1.036904
C  0.209760 -0.134528  1.853700 -0.149177

In [31]:
df.reset_index() #numeric values as an index #inplace=True

  index         W         X         Y         Z
0     A -0.159073  3.013091 -0.315412 -1.596046
1     B -0.604125 -0.812272  0.526444 -1.036904
2     C  0.209760 -0.134528  1.853700 -0.149177

In [35]:
newindex = 'SA PA NA'.split()
newindex

['SA', 'PA', 'NA']

In [38]:
df['States'] = newindex #append
df

          W         X         Y         Z States
A -0.159073  3.013091 -0.315412 -1.596046     SA
B -0.604125 -0.812272  0.526444 -1.036904     PA
C  0.209760 -0.134528  1.853700 -0.149177     NA

In [39]:
#if you want column to set as an index them

df.set_index('States')

               W         X         Y         Z
States
SA     -0.159073  3.013091 -0.315412 -1.596046
PA     -0.604125 -0.812272  0.526444 -1.036904
NA      0.209760 -0.134528  1.853700 -0.149177